In [3]:
import mysql.connector as connection
import pandas as pd

try:
    mydb = connection.connect(host="localhost", user="root", passwd="mysql", use_pure=True)
    mycursor = mydb.cursor()
    query = "USE FSDS_assignment"
    mycursor.execute(query)
    print(mycursor.fetchall())
    
except Exception as e:
    mydb.close()
    print(str(e))

[]

#### Q-1. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.

In [4]:
query = "SELECT replace(first_name, 'a', 'A') FROM WORKER "
mycursor.execute(query)
rslt = mycursor.fetchall()
df = pd.DataFrame(rslt)
print(df)

           0
0      Krish
1  SudhAnshu
2     SAnket
3     DArius
4    SAthish
5  ShAktimAn

#### 2 - Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

In [7]:
query = "SELECT * FROM WORKER ORDER BY FIRST_NAME ASC, DEPARTMENT_NAME DESC"
mycursor.execute(query)
rslt = mycursor.fetchall()
df = pd.DataFrame(rslt)
print(df)

   0          1        2      3                   4            5
0  4     Darius  Bengali  70000 2015-12-13 09:00:00           HR
1  1      Krish     Naik  50000 2014-12-11 09:00:00  Development
2  3     Sanket    Kumar  70000 2014-12-11 09:00:00           HR
3  5    Sathish  Bhansal  30000 2017-10-21 09:00:00   Accountant
4  6  Shaktiman     Hero  50000 2017-12-11 09:00:00   Accountant
5  2  Sudhanshu    Kumar  60000 2014-12-11 09:00:00  Development

#### Q-3. Write an SQL query to fetch the names of workers who earn the highest salary.

In [6]:
query = "SELECT FIRST_NAME, SALARY FROM WORKER WHERE SALARY = (SELECT MAX(SALARY) FROM WORKER)"
mycursor.execute(query)
rslt = mycursor.fetchall()
df = pd.DataFrame(rslt)
print(df)

        0      1
0  Sanket  70000
1  Darius  70000